Python 3.11.3 (v3.11.3:f3909b8bc8, Apr  4 2023, 20:12:10) [Clang 13.0.0 (clang-1300.0.29.30)] on darwin
Type "help", "copyright", "credits" or "license()" for more information.
>>> from flask import Flask, render_template, request
... app = Flask(__name__)
...  
... class Книга(object):
...     def __init__(self, название, автор, год_издания):
...         self.название = название
...         self.автор = автор
...         self.год_издания = год_издания
...      
...     def __str__(self):
...         return f"Книга: {self.название}, Автор: {self.автор}, Год издания: {self.год_издания}"
...  
... class Библиотека(object):
...     def __init__(self, название, книги):
...         self.название = название
...         self.книги = книги
...      
...     def __str__(self):
...         return f"Библиотека: {self.название}"
...  
... # Создаем экземпляры класса Книга
... книга1 = Книга("Преступление и наказание", "Федор Достоевский", 1866)
... книга2 = Книга("1984", "Джордж Оруэлл", 1949)
... книга3 = Книга("Улисс", "Джеймс Джойс", 1922)
... книга4 = Книга("Гарри Поттер и философский камень", "Джоан Роулинг", 1997)
... книга5 = Книга("Великий Гэтсби", "Фрэнсис Скотт Фицджеральд", 1925)
...  
... # Создаем экземпляры класса Библиотека
... библиотека1 = Библиотека("Центральная библиотека", [книга1, книга2, книга3])
... библиотека2 = Библиотека("Детская библиотека", [книга4, книга5])
...  
... @app.route("/")
... def hello_world():
...     return render_template('index.html', библиотека1=библиотека1, библиотека2=библиотека2)
...  
... if __name__ == "__main__":
